---
kind: type
id: T:Autodesk.Revit.DB.Analysis.ConceptualConstructionOpeningType
source: html/562a88f7-3d67-367e-63a1-ac4e7ec3b884.htm
---
# Autodesk.Revit.DB.Analysis.ConceptualConstructionOpeningType

ConceptualConstructionType values for Openings.

## Syntax (C#)
```csharp
public enum ConceptualConstructionOpeningType
```